#pragma once

/////////////////////////////////////////////////////////////////
// <버전 정보>
// 새로운 검사 추가, UI 개편 등 : *.x.x
// 검사 알고리즘 변경, 검사 파라미터 추가, 기능 변경 등 : x.*.x
// 버그 수정, 코드 리팩토링, UI 위치 조정 등 : x.x.*
/////////////////////////////////////////////////////////////////

#define VERSION_MAJOR 2
#define VERSION_MINOR 9
#define VERSION_PATCH 1
#define VERSION_BUILD 0

#define STRINGIFY(x) #x
#define TOSTR(x) STRINGIFY(x)

#define FULL_VERSION_STR TOSTR(VERSION_MAJOR) "." TOSTR(VERSION_MINOR) "." TOSTR(VERSION_PATCH) "." TOSTR(VERSION_BUILD)
#define FILE_VERSION_STR TOSTR(VERSION_MAJOR) "." TOSTR(VERSION_MINOR) "." TOSTR(VERSION_PATCH)

//=========================================================
// v 2.9.1
// AfxMeesegeBox 언어 변환
// Label 검사 Edge Margin Parameter 추가 (warpage가 너무 심해서)
// Area, Model 설정 OK되면 Save 자동으로 되도록 구문 수정.
//=========================================================
// v 2.9.0
// Matching 7? -> 10수정
// MBB, BoxQuality Model 등록 여러개 되도록 수정
// Chip Cnt ROI 버그 수정
// Label Edge 쏠림 주석 풀기.
// 권한에 따른 Refresh 수정
// 신규 레시피 생성 시, 자동으로 Jobnumber도 수정되도록
//=========================================================
// v 2.8.8
// 204, 205 Matching Model 수량 증가.
//=========================================================
// v 2.8.7
// 203 SubMaterial Insp 수정2 - Dialog도 수정.
// Manual doubleclick area 조건 수정.
// 우 하단, 날짜 표시 추가
//=========================================================
// v 2.8.6
// Teaching 이후 Save 버튼 누르게끔 프로그램에서 유도
// 203 SubMaterial Insp 수정.
//=========================================================
// v 2.8.5
// Banding Insp 수정
// Tray Ocr Roi err Log 추가.
//=========================================================
// v 2.8.4
// 전체 화면 캡처 기능 추가. (Menu bar Jobfile 변경)
// Lift Front Offset 값 따로 적용 되도록 요청에 따라 수정
// PageCount Programmer 권한으로
// 203 SubMaterial 위치 변경
//=========================================================
// v 2.8.3
// Mixing Bug 수정. Plain mode 일 때 검사 안하도록
// 3D Chip Cnt Bug 수정. Check box 동작 안했음
// 203 Cutting 부분 수정. Blob 최대 사이즈로 뭉치기 추가
// 201 lift 검사 NG 사이즈 앞에 뭐에 대한 NG인지 표기.
//=========================================================
// v 2.8.2
// 202 HIC Inner 길이 관련 수정 (Sorting 문제점 발견)
// 201 3D ChipCnt Bug 발견 수정
// 203 Vision Graphic Text 수정
//=========================================================
// v 2.8.1
// 203 SubMaterial Text Graphic 수정
//=========================================================
// v 2.8.0
// 202 HIC Matching Model 등록 추가 ( Recipe 별로 HIC가 다른 것을 구별 하는지 )
// 205 Sealing 조건 반대인 것 추가 ( Tight, Loose 선택 가능하도록 )
//=========================================================
// v 2.7.2
// Manual pdf로 변경
//=========================================================
// v 2.7.1
// Banding, Stacker Image Save Name 형식 변경
// Inspect Text Graphic 한영 변환에 따라 변경되도록
//=========================================================
// v 2.7.0
// 207 Box Tape 아랫면 부착 검사 추가 (제대로 안 붙었으면 나팔나팔 거릴테니 아래 부분 검사)
//=========================================================
// v 2.6.6
// 202 HIC Color Tool Tip 검사 추가.
//=========================================================
// v 2.6.5
// 201 ACM Lift Line Scan이라서 통신 수정 (순서:acm->vis->vis return->grab)
//=========================================================
// v 2.6.4
// Stacker Ocr 버그 및 티칭 전체 수정
// 201 Mixing, Lift Tray 수량 pass(도대체 언제 제대로 넘겨줄지..)
// 203 Desiccant Pos 검사 후 Cutting 할 때 Pos Light Off 진행.
//=========================================================
// v 2.6.3
// Server Close 추가
// ACM Stop Mode일 때 조건 변경
//=========================================================
// v 2.6.2
// 202 HIC Rect 지정
//=========================================================
// v 2.6.1
// 202 m_Timer Test 진행
// banding close 연산 추가, Angle 5도->10도 변경
// Auto Calibration void 함수에서 BOOL 타입으로 변경 (결과 송부 하기 위해)
// Recipe Load 시, Match Load bug 수정 (황대은 잡일로 인한 버그)
//=========================================================
// v 2.6.0
// Box Quality Shift 검사 추가
//=========================================================
// v 2.5.8
// Desiccant ACM 개발 완료 (3DChip은 JIG에 날개가 없어서 테이블 위에 올릴 수가 없네)
// ToolTip 설명 오 기입 수정
// 201 ChipCnt Bypass 기능 수정 (Dee에서 보내는 m_b결과 TRUE로 변경되도록)
// Lift 검사 Tray 수량 맞지 않으면 Broken, Lift 검사 X
//=========================================================
// v 2.5.7
// Auto Calibration Mode 개발 중. (3DChip, Desiccant 남음)
// Tooltip 마우스 클릭으로 변경
//=========================================================
// v 2.5.6
// Label Ocr Font Add Bug 수정
// ACM 기초 틀 잡는 중
//=========================================================
// v 2.5.5
// 201 des Chip cnt Des에서 초기화 되도록 추가
// Label Segment Image loading 했을 때, Threshold bug 수정
//=========================================================
// v 2.5.4
// Chip Ocr Threshold 기능 및 Preview 추가. 
//=========================================================
// v 2.5.3
// ISS 구문 수정. Tray Ocr 이미지 저장 후 경로 systemcfg.ini에 저장해서 iss구문 올 때 꺼내 쓰기.
//=========================================================
// v 2.5.2
// Merge Image Inspection Area 표기
// Remove -> Rework(Rename) 으로 변경 * 요청사항
//=========================================================
// v 2.5.1
// Recipe Load 시, Bug 발견하여 수정 진행 ( Upload 이후 Recipe 선택에 문제가 )
//=========================================================
// v 2.5.0
// Chip Cnt Server에 Merge하여 저장 Test만 진행 완료
// 204 MBB buffer 제거
//=========================================================
// v 2.4.5
// 3D Chip Server Save 명칭 변경
// MBB Buffer 관리 Test 진행 중->런으로 인해 stop
//=========================================================
// v 2.4.4
// 장비에서 자재 스크랩 시, 이미지 저장된 내역 삭제.
// RBD 구문 추가
//=========================================================
// v 2.4.3
// 비검사 영역 스핀 컨트롤 Up Down 변경
// Tooltip 함수화
//=========================================================
// v 2.4.2
// Stacker ocr 검사 수정 및 Image Cut 기능 추가 완료
//=========================================================
// v 2.4.1
// MBB px <-> mm 선택 가능하도록
// Lift 비검사 영역 기능 추가
// 3D ChipCnt, Lift, px-mm 권한에 따라 숨기기
//=========================================================
// v 2.4.0
// Stacker ocr bin Data Save, Load 및 변환 확인 완료.
// 201 3D Chip Cnt Viewer2번 삭제.(지시)
//=========================================================
// v 2.3.9
// Stacker Ocr 빅머사 영역 추가
// chip cnt, Lift mm - px 추가
// Tape mm -> px로 변경
//=========================================================
// v 2.3.8
// 비검사 영역 삭제 및 버그 수정
// Tray Ocr 문자열 대문자로 변환 후 동일하면 OK 판정 추가
// 마스킹 색상 평균 - 10의 값으로 설정
// 폰트 재 생성 버그 수정
// OCR 영역 티칭할 때 비검사 영역 전부 삭제
//=========================================================
// v 2.3.7
// Tray Ocr 미검사 영역 추가.
// 3D Chip Cnt 검사 측정 단위 px <-> mm 사용자 선택 가능하도록 수정
//=========================================================
// v 2.3.6
// 201 ISS 구문 추가.
// 201 Select Unit 기능 시작 분기점.
//=========================================================
// v 2.3.5
// Ocr Bug 수정, 이미지 미리보기 다 나오도록 수정
// Stacker Depth Data 검사 가능하도록 수정
// 201 DEE Bypass Data 제거.
// 201 Chip Ocr 방향 회전.
// 201 Tray Ocr 방향 회전 기능 Bug 수정
//=========================================================
// v 2.3.4
// 201 Chip Cnt 검사 이후 VIE 넘기도록 변경 (이미지 늘어짐)
// 205 Loose Sealing 검사 수정 (협의된 내용으로 변경)
// 201 3D Chip mm -> px로 변경
//=========================================================
// v 2.3.3
// 205 Sealing Quality 검사 수정
// 수동 조명 on 이후 탭 변경 시 조명 Off
//=========================================================
// v 2.3.2
// NG 누락된 Tape, MBB 추가
// -- 미비 : Chip Cnt 카메라 회전 생각해보자. 일단 돌려보고 느리면 원복 -> 속도 괜찮아보임.
//=========================================================
// v 2.3.1
// 201 Chip Cnt Object 방향 180도 회전
// OP단 기준 트레이 좌하단이 그랩 시작 위치 및 1번 칩의 위치.
// 그러나 카메라는 180도 회전으로 달려있어서 이미지는 반대로 나옴.
//=========================================================
// v 2.3.0
// 각 Tab 레이블 우측 구석 마우스 올릴 시 간단 티칭 매뉴얼 팝업
//=========================================================
// v 2.2.3
// Edit Control Tooltip 추가
//=========================================================
// v 2.2.2
// Image Send 기능 추가, Send Path Parameter 추가, 기능 사용 유무 체크 Parameter 추가
// System 다국어 변환
// Edit control Tooltip 추가 ( 203~207 )
//=========================================================
// v 2.2.1
// Image Save Merge 때문에 형식 변경
// Lot Id로 Folder 구분 및 MergeImgBuf 생성
//=========================================================
// v 2.2.0
// 201 Lift
// - Front 검사와 Rear 검사 Width 분리
// ========================================================
// v 2.1.3
// 205 Sealing Quality 검사 추가
// ========================================================
// v 2.1.2
// 201 Mixing
// - TrayCount 검사 폭이 TrayMixingZoneWidth로 되어있던 버그 수정 
// ========================================================
// v 2.1.1
// 203 부자재 검사
// - 부자재가 검사 구획 벗어났는데 결과 OK이던 버그 수정
// - 방습제 검사에서 간헐적으로 결과 OK인데 NG나오던 버그 수정
// DisplayEException() Text Positiom X, Y 파라미터 추가
// ========================================================
// v 2.1.0
// 201 Lift 검사
// - Offset 파라미터 추가
// - Lift 검사영역과 Break 검사영역을 나누지 않고 하나로 통합
// 불필요 내역 정리.
// ========================================================
// v 2.0.1
// 201 Mixing 검사 RectInImage()로 ROI가 이미지 벗어났는지 검사
// 203 부자재 검사 Score 미달일 때 결과 텍스트 NG Display
// ========================================================
// v 2.0.0
// 205 Sealing Quality Form 추가
// ========================================================
// v 1.8.1
// 201 AutoRun 클릭 시 obj 화면 보이도록 수정
// 통신 부분 DEE도 DES, VIS와 같게 통일화
// ========================================================
// v 1.8.0
// ProcessBuffer() SST 프로토콜 추가
// 203 부자재검사 Tray 검사 삭제
// - 검사테스트 버튼은 영역만 보는 것으로 변경
// 장비에서 수정했던 소스 Merge (201, 203)
// ========================================================
// v 1.7.7
// 201 Mixing 검사 박스 이미지 범위 벗어났을 때 버그 변경
// VisionSystem::ProcessBuffer()쪽 코드 리팩토링
// - DES, VIS 함수에서 데이터 Extract
// ========================================================
// v 1.7.6
// 203 부자재 검사 Grab 2번 찍을 필요 없어져서 관련된 코드 변경
// 201 Lift 검사 TimeDelay() 삭제
// ========================================================
// v 1.7.5
// 203 Position Left 검사, Right 검사 칼날 위치 다르게 수정
// Color Line Blob 잡을 때 Blob Area 기준으로 내림차순 정렬
// ========================================================
// v 1.7.4
// 205 Box Quality 검사 조명 2번 키는 것으로 변경
// 203 Desiccant Position 이미지 미리보기 관련 버그 수정
// 203 Desiccant Position 조명 2번 키기 (부자재는 1번만)
// 205 Box 검사 이후 조명이 안꺼지는 현상이 있어서 2회 반복
// SST 구문 추가, 각 그룹 첫 Socket에서만 전달 받고, 제어프로그램 자동운전 시 전달 받아서 시간 설정
// ========================================================
// v 1.7.3
// Access Right 변경 했을 때 Refresh가 아닌 Control Enable하는 코드 호출하도록 변경
// Box Quality 검사 Light Value 로그 추가
// ======================================================== = 
// v 1.7.2
// 201 Chip 검사 Text Graphic 위치 조정
// 변수이름 및 Graphic 텍스트 변경 (Amount → Quantity)
// 207 61VIS Grab 이후로 변경
// ======================================================== = 
// v 1.7.1
// 203 부자재 조명 2번 키기
// 205 des에서 조명 키기
// ======================================================== = 
// v 1.7.0
// 203 부자재 검사
// - Matching으로 영역 못잡아서 Tray 단수에 따라 영역 설정 되도록 알고리즘 변경
// - VIS에서 Tray 단수 받음
// - Tray 검사 Bypass는 SubMaterial Recipe에 있는 Bypass 설정 여부에 종속되도록 변경
// - 부자재 검사 할 때 등록된 모델 템플릿이 Grab된 패턴 크기보다 클 때 그래픽 Box Scale 조정하여 부자재 크기만큼만 그려지도록 설정
// ======================================================== = 
// v 1.6.2
// EVisionOCRAddFont()에서 쓰레기값까지 읽는 경우 Font Size가 안맞아서 Return되고 Font 등록이 안되는 현상 알람 추가
// - Viewer에서는 222...[9] 였는데 Add에서 222...[10]으로 사이즈가 안맞았었음.
// ======================================================== = 
// v 1.6.1
// Cleanup(), 검사 영역 및 모델 티칭 코드 공통 수정
// - 버튼 눌렀을 때 해당 버튼 제외하고 다른 버튼 전부 비활성화 되도록 하고 Cleanup()하면 원복되도록 수정
// ======================================================== = 
// v 1.6.0
// OCR 검사(Tray, Stacker, Chip) 티칭 방식 변경
// - OCR Distance 파라미터 직접 입력 안하고 뷰어에서 영역 지정했을 때 티칭되도록 변경
// ======================================================== = 
// v 1.5.1 
// - Stacker OCR Align 모델 티칭하면 프로그램 종료되던 버그 수정
// ======================================================== = 
// v 1.5.0
// ▶ 203 Desiccant Position
//  - Pattern Matching Score 검사 파라미터 추가
// ▶ Stacker Line 스캔 카메라 Ondepth() image rotate 관련 코드 변경
// ======================================================== =
// v 1.4.7
// - 검사별 Error Msg 위치 통일, 203 Desiccant Position 에러 메세지 변경
// ======================================================== =
// v 1.4.6
// ▶ 203 stdafx.h enum InspectType 이름 변경
//	- InspectTypePosition → InspectTypePositionLeft,	InspectTypePosition2 → InspectTypePositionRight 
//	- InspectTypeDesiccant → InspectTypeDesiccantLeft, InspectTypeDesiccant2 → InspectTypeDesiccantRight
// ▶ 검사 중 EException 발생시 DisplayEException()로 통일
//	- 함수 내에 error log 남기는 코드 추가
// ▶ TrayOCR 결과 NG일 때 Color Red로 Display 되도록 수정 
// 
// ======================================================== =
// v 1.4.5
// - CrashRpt -> CrashRpt2로 변경 ( vc2017 ver)
// ======================================================== =
// // 실행파일 만들어지는 곳에 있는 _Change PGM Name_*.bat는 릴리즈 빌드 후 bat 실행 시 알아서 이름 변경 후 바탕화면에 바로가기 까지 생성
// ======================================================== =
// v 1.4.4
// - 201 Mixing 검사 모델 티칭 안되던 버그 수정
// - Recipe 변경 후 Apply 하지 않고 다른 메뉴(검사, 장치)로 이동했을 때 나타나던 버그(일부 컨트롤이 Disable풀리는 문제) 수정
// ======================================================== =
// v 1.4.3
// - VersionInfo.h에서 값만 바꾸면 됨.
// ======================================================== =
// v 1.4.2
// - Title Name 수정, FILEVERSION, PRODUCTVERSION으로 버전 관리하면 어떨지... ? 빌드 시간이 오래 걸려서 별로일지도.
// ======================================================== =
// v 1.4.1
// 203 Desiccant Position
// - 칼날 위치(기존 : 180 → 변경 : 185) 및 Color Line 검사 박스 위치(기존 : 칼날위치 + 12 → 변경 : 칼날위치 + 1) 변경
// - Color Line 길이가 20px미만일 경우 NG나도록 변경
// ======================================================== =
// v 1.4.0
// 202 Banding
// - 검사 Blob → Line Gauge로 변경
// ======================================================== =
// v 1.3.3
// - 티칭 탭에서 Recipe 변경 후 Apply 하지 않고 다른 탭으로 이동했을 때 발생하는 버그 수정
// ======================================================== =
// v 1.3.2
// - 티칭 탭에서 콤보박스 Recipe 변경 되었을 때 사용하는 DisableWnd()코드 리팩토링
// ======================================================== =
// v 1.3.1
// - 202 HIC VIE Ng코드 보내기 위한 변수 값 설정하는 코드 위치 변경
// ======================================================== =
// v 1.3.0
// 202 HIC
// - Red Avg로 판정 불가능한 Card 있어 RGB 中 선택하여 NG / OK 판정 할 수 있도록 파라미터 추가
// ======================================================== =
// v 1.2.4
// 203 Desiccant
// - 파라미터 이름 길어서 잘리는 부분에 ToolTip 표시되도록 추가
// ======================================================== =
// v 1.2.3
// 203 Desiccant Position 검사
// - 변수이름 변경 : m_bDesiccantInsp → m_bDesiccantInspRight
// - DES에서 조명 On하고 DEE에서 조명 Off로 변경(기존 VIS에서 On, VIE에서 Off)
// - ProcessBuffer()에 변수 추가 : strDesDataRight, strDesDataLeft
// ======================================================== =
// v 1.2.2
// 203 부자재 검사
// - Edit Box 위치 조정
// 205 Box Quality
// - 이미지 이진화 하여 Template 모델과 비교하던 부분 주석처리(Over Kill 다수 발생)
// ======================================================== =
// v 1.2.1
// 201 Mixing
// - Recipe Change할 때 "Plain pattern" TRUE일 때 등록 된 model 관련 컨트롤이 disable 되지 않는 버그 수정
// ======================================================== =
// v 1.2
// 203 부자재 검사
// - 패턴 매칭할 때 찾아진 object 검은색 영역으로 덮어써 중복 matching 방지
// - Pattern Rotation Angle 파라미터 삭제
// - 패턴 매칭 영역 graphic color 변경 : green → blue
